#define  _CRT_SECURE_NO_WARNINGS 1

//转义字符  转变了他原来的意思                                              
//1  \? 在书写连续多个问号时使用，防止他们被解析成三字母词   
//2  \' 用于表示字符常量' 
//3  \“ 用于表示一个字符串内部的双引号
//4  \\ 用于表示一个反斜杠，防止它被解释为一个转义序列符。
//5  \a 警告字符，蜂鸣
//6  \b 退格符
//7  \f 进纸符
//8  \n 换行
//9  \r 回车
//10 \t 水平制表符
//11 \v 垂直制表符
//12 \ddd ddd表示1~3个八进制的数字。 如： \130 X
//13 \xdd dd表示2个十六进制数字。 如： \x30 0

#include <stdio.h>
int main()
{
	printf("c:\test\test.c");   //打印出来没有t 只有est


	printf("ab\ncd");//\+n不再是普通的  已经变成转义字符                            

	return 0;
 }






int main()
{
	
	printf("(are you ok??)");//??)--]-三字母词
	//(are you ok]

	 


	 
	printf("%c\n", 'a');
	printf("%c\n", '\'');  //如果打印'引号  需要加\ 则能单独打'单引号
	printf("%s\n", "abc");
	printf("%s\n", "a");
	printf("%s\n", "\""); //打印双引号就要加\
	//printf在打印数据的时候。可以指定打印的格式






	//回到最初的问题
	printf("c:\test\test.c");//打印不出来test 只能打出est 所以要加\\。
	printf("c:\\test\\test.c");  //能打出test  \\转义我们的转义




	printf("\a\a\a"); //\a起到电脑发出登登的作用  



	return 0;
}

  




//printf（"%d",100）;   %d打印数组
//printf("%c",'a');     %c打印单字符
//printf("%s","abc");   %s打印字符串


	//两种特殊的转义字符
	//  \ddd  ddd表示1~3个八进制的数字。 如： \130 X
	//  \xdd  dd表示2个十六进制数字。 如： \x30 0
int main()
{
	printf("%c\n", '\130'); //8进制的130是十进制的多少   1--8的2次方     3--8的1次方     0--8的0次方   8进制的130代表十进制的88
//X---ASCII码值是88                                    十进制的130   1--10的2次方    3--10的1次方    0--10的0次方   100+30+0=130
	

	printf("%c\n",'\101');   // A - 65 - 8进制是：101

	printf("%c\n", '\x30');//48 - '0'

	return 0;
}

//键盘上敲出的字符
//@！ER1...
// A - 65
// B - 66
// a - 97
// b - 98     ASCII码表  每一个字符都有一个值：ASCII码值 
