#define  _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

int main()
{
	int a = 0;
	printf("%d\n", ~a);//~波浪号  按位取反
	//结果是-1    按（二进制）位取反
//把所有二进制位中的数字，1变成0，0变成1
	//整数 a=0    0的二进制是32个0  二进制：00000000000000000000000000000000
	//~波浪号 按位取反  0变成1  所以上面就是11111111111111111111111111111111 ~a



	//整数在内存中存储的是补码~   一个整数在二进制表示有3种：原码 反码 补码
    //-1的原码  10000000000000000000000000000001（原码） 
	//按位取反 符号位不变 剩下的变 11111111111111111111111111111110(反码)
	//11111111111111111111111111111111（补码） 存的是补码                                   正整数 ：原码反码补码相同   

	//符号位不变 其他位按位取反 反码+1得到补码  补码-1变成反码 反码取反变成原码

	return 0;
}










int main()
{
	//int a = 10;
	//int b = ++a;//前置++  先++后使用  ++a先变成11

	//printf("%d\n", b); //b=11
	//printf("%d\n", a);//a=11





	int a = 10;                                                                         //int b=(++a)+(++a)+(++a) 错误的 不研究 有些这么出题 但是错误
	int b = a++;  //后置++    a++ 先使用a=10  给b赋10  再++  10+1=11 到a上 前置同理
	printf("%d\n", b);//10
	printf("%d\n", a);//11

	return 0;
}







   (类型)  强制类型转换

int main()
{
	int a = (int)3.14;//单独放3.14会报错  如何强制转换 前面加（int） 3.14
	printf("%d\n", a);

	return 0;	
}




&取地址  *间接访问操作符






逻辑与&&     逻辑或||
int main()
{
	int a = 3;
	int b = 0;
	int c = a || b; //一个为真就行 
	printf("%d\n", c);







	int a = 3;
	int b = 0;  //如果b是0  则为假 则结果为假 是0 两个是真 结果就是真
	int c = a && b;
	printf("%d\n", c);
	if (a && b)
	{

	}

	return 0;
}







//条件操作符 （三目操作符） 表达exp1? exp2： exp3  
//表达式exp exp1如果成立 exp2计算 整个结构是 exp2的结果
//exp1不成立 exp3计算 整个表达式结构是exp2的结果


int main()
{
	int a = 0;
	int b = 3;
	int max = 0;

	if (a > b)
		max = a;
	else
		max = b;

	max = a > b ? a : b;
	printf("%d\n", max);
	return 0;
}








//逗号表达式
int main()
{
	//(2, 4 + 5, 6);
	int a = 0;
	int b = 3;
	int c = 5;
	//    a= 5        c=1          b=3
	int d = (a = b + 2, c = a - 4, b = c + 2);
	printf("%d\n", d);  //逗号表达式是从左向右依次计算的   整个表达式的结果是最后一个表达式的结果

	return 0;
}







//下标引用，函数调用和结构成员  [] () . ->



//下标引用操作符

int mian()
{
	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
	printf("%d\n", arr[5]);

	return 0;
}


//函数调用操作符

int main()
{
	//后面这个（）就是调用操作符
	printf("hehe\n");

	return 0;
}